//以年度為基準的統計(未成年發生事故)
db.getCollection("112_years_A1_and_A2").aggregate(
    [
        {
            $group:
            {
                _id: { 
                    區序: "$區序",
                    發生年度: "$發生年度"
                },
                未成年人數:
                {
                    $sum:
                    {
                       $cond:
                       {
                            if:
                            {
                                $or:
                                [
                                    {$eq:["$職業",34]},
                                    {$eq:["$職業",14]},
                                    {$eq:["$職業",15]},
                                    {$eq:["$職業",16]}
                                ]
                            },
                            then: 1,
                            else: 0
                       }
                    }
                }
            }
        },
        {
            $sort:
            {
                "未成年人數": -1
            }
        },
        {
            $project:
            {
                _id: 0,
                地區: "$_id.區序",
                年度: "$_id.發生年度",
                未成年人數: "$未成年人數"
            }
        }
    ]
)

//查詢並排序每個地區每個月的受傷人數+總死亡人數
db.getCollection("112_years_A1_and_A2").aggregate(
    [
        {
            $group:
            {
                _id:
                {
                    地區:"$區序",
                    月份:"$發生月"
                },
                受傷人數:{$sum:"$受傷人數"},
                總死亡人數:
                {
                    $sum:
                    {
                        $add:
                        [
                            "$死亡人數",
                            "$2-30日死亡人數"
                        ]
                    }
                }
            }
        },
        {
            $sort:
            {
                "_id.地區":1,
                "_id.月份":1
            }
        },
        {
            $project:
            {
                _id:0,
                "地區":"$_id.地區",
                "月份":"$_id.月份",
                "受傷人數":"$受傷人數",
                "總死亡人數":"$總死亡人數"
            }
        }
    ]
)